{
  "meta": { "theme": "elegant" },
  "basics": {
    "name": "Brandon M. Camenisch",
    "label": "*Ops (DevOps, DevSecOps, GitOps, AIOps, MLOps, etc.",
    "picture": "bio.jpg",
    "location": {
      "city": "Coeur d'Alene",
      "region": "ID",
      "countryCode": "USA"
    },
    "website": "https://brandoncamenisch.com",
    "summary": "With over 20 years of experience in development, leadership, and project management, I get the job done with top quality results every time. From being a key player in DevOps teams to ample experience with open-source technologies, I live and breathe development and infrastructure. Upper management and peers have found my can-do attitude and willingness to go above and beyond invaluable. I am seeking a position with greater responsibilities, cutting-edge tooling, and new development challenges. I have a proven track record of excellence, including: \n - Recognition for Subject Matter Expertise in DevOps tooling, cloud infrastructure, and software architecture. \n - Demonstrating Outstanding Leadership in engineer mentoring, project management, and incidence response.\n - Making Effective Executive Decisions regarding deployment strategy, team building, infrastructure budgets, and operational objectives.",
    "profiles": [
      {
        "network": "Github",
        "username": "brandoncamenisch",
        "url": "https://github.com/brandoncamenisch"
      },
      {
        "network": "LinkedIn",
        "url": "https://www.linkedin.com/in/brandon-camenisch-625288212"
      },
      {
        "network": "Twitter",
        "url": "https://twitter.com/brandoncamenisc"
      }
    ]
  },
  "work": [
    {
      "company": "PMC (Penske Media Corporation)",
      "position": "Senior DevOps/CloudOps Engineer",
      "website": "https://pmc.com",
      "startDate": "2016-01-01",
      "endDate": "2021-06-11",
      "summary": "Chief engineer designated as the primary architect and developer of cloud infrastructure solutions. Credited with consistently delivering secure automation during acquisitions and upholding immaculate cyber-security and site reliability standards throughout the entire company. Responsible for training new engineers, creating a blameless DevOps culture, and acting as primary point of contact in ensuring deliverables and standards are met between the engineering team, customers, and C-Suite.",
      "highlights": [
        "Automated resource provisioning across hybrid and cloud agnostic environments including AWS, GCP, and Azure, by utilizing Terraform to streamline scaling with stable and reproduceable infrastructure as code and adapting to changes in resource demands by utilizing GitOps methodologies.",
        "Expert in Terraform ecosystem and experienced in selecting and implementing additional automation tools into the HashiCorp ecosystem.",
        "Grew IaC codebase and scaled up infrastructure by staying up to date with new solutions, determining business pain-points, and managing growth with strategically chosen 3rd party solutions including: Cloudflare, Fastly, Datadog, New Relic, GitHub, Bitbucket, OpsGenie, PagerDuty, and many others.",
        "Proactively managed issue tracking, disaster recovery, and identification of emergent security weaknesses in workflows by implementing DevSecOps practices and ChatOps response methodologies for autonomously solving issues by leveraging data monitoring tools like New Relic, DataDog, and Grafana in conjunction with incidence response and ticket management tools such as OpsGenie, PagerDuty, and Jira.",
        "Created an engineering culture of self-service, personal responsibility, and minimal redundancy by enforcing strict control of design patterns and improving upon workflow standardization. ",
        "Leveraged serverless technologies to cut costs, speed up delivery, and scale effectively.",
        "Managed multiple complicated legacy server and cloud migrations by ingesting business critical processes and software from multi-tenancy environments, applying 12 factor app design methodologies, creating infrastructure as code to supplant previous resources, and adding these new assets to the self-scaling, autonomous GitOps pipeline",
        "Enhanced company cyber-security by educating engineers and general staff on security best practices and preemptively mitigated risks by training and enforcing standards such as securing data at rest, applying cryptography, networking monitoring and firewalling, and security focused review of systems and codebases."
      ]
    },
    {
      "company": "10up",
      "position": "Senior Engineering Manager",
      "website": "https://10up.com",
      "startDate": "2014-01-01",
      "endDate": "2016-01-01",
      "summary": "In charge of product delivery for high-profile clientele, including Fortune 100 companies. Tech Crunch, 9 to 5 Mac, Google, Universal Studios, and Microsoft being the most prominent. Responsible party providing leadership to a team of fifteen engineers, held accountable for consistently delivering products on time and with outstanding quality.",
      "highlights": [
        "Represented team of software engineers to engage and complete large scale data migrations, application development, unexpected engineering tasks and ensure customer satisfaction. Implemented culture change towards a blameless self-service DevOps model among engineering teams.",
       "Conducted large scale lift and shift projects migrating content and data for Fortune 500 companies with no downtime or impact to the business by utilizing real-time database replication via data streams.",
       "Implemented caching layers into applications to increase overall performance, end user retention, and save costs.",
       "Accurately determined the resources and strategic needs of large and complex projects; oversaw and ensured the product quality produced from engineering teams.",
       "Managed customer and vendor expectations while providing solutions that met their business objectives, technical needs, and budget constraints.",
       "Wrote tooling that abstracted testing workflows pertinent to engineering teams including a/b testing, unit testing, behavior-driven development, test-driven development, and testing operations that formerly had to be completed manually before I drafted and implemented automation solutions",
       "Provided extensive business value by abstracting customer tooling needs, developing reusable software as a solution, and utilizing these new tools as drop-in services for clients with similar requirements and needs.",
       "Orchestrated unique Docker deployments with Kubernetes clusters and implemented automated testing through the entire CI/CD process",
       "Created a reproducible development environment utilizing Vagrant and Virtual Box for engineers that speed up development time, reduced code collisions, and increased collaboration. ",
       "Provided remote training on ongoing professional development to engineering teams, as well as 1 to 1 employee mentoring, training, and coaching.",
       "Embodied extreme ownership, taking control of not only leadership objectives, but also positively creating and influencing company culture, working face to face with clients and stakeholders, and interfacing directly with top-level management."
      ]
    },
    {
      "company": "Volume Nine",
      "position": "Senior Software Engineer",
      "website": "https://www.v9digital.com/",
      "startDate": "2014-01-01",
      "endDate": "2015-01-01",
      "summary": "Volume Nine is Denver's top digital marketing agency, specializing in content, SEO, and social media. Build Brand. Drive Traffic. Grow Sales.",
      "highlights": [
        "Developed against large dataset(s) of marketing data with heavy usage of MySQL database and google analytics platform",
        "Strategized marketing/seo campaigns for client sites from a techinnal perspective",
        "Worked on early stage development/testing of SkyWord solution for WordPress"
      ]
    },
    {
      "company": "QRlicious|Visioniz",
      "position": "Senior Software Engineer",
      "startDate": "2013-01-01",
      "endDate": "2014-01-01",
      "summary": "QRlicious is a mobile marketing company offering a platform for users to manage and build QR codes, mobile websites, coupons, and more.",
      "highlights": [
        "Hand built a WordPress framework from the ground up using DRY & semantic approach",
        "Programmatically generated QR codes with custom built SVG tool(s) HTML5 canvas and RaphaëlJS",
        "Embraced mobile marketing microsites trend by building a SaaS product site building tool on Rails",
        "Engineered custom REST based APIs",
        "Integrated with various payment gateway systems for e-comm using Stripe, PayPal, Authorize.net and others"
      ]
    },
      {
      "company": "Nerdatory",
      "position": "Consultant",
      "startDate": "2006-01-01",
      "endDate": "2012-01-01",
      "summary": "Consulting firm specializing in architecture, security and best practices of software development.",
      "highlights": [
        "Provided strategic engineering consulting to startups",
        "Demonstrated how to predict growth and scale a product without hitting a wall in the process",
        "Conducted in-depth security audits for clients identifying weaknesses in their corporate IT structure",
        "Collaborated with team of engineers to architect and reconstruct their SaaS product from the ground up",
        "Mentored teams in software life cycle processes using TDD, CI, code reviews, security conventions, and engineering best practices"
      ]
    },
    {
      "company": "Silvereve Interactive",
      "position": "Founder",
      "startDate": "2002-01-01",
      "endDate": "2000-01-01",
      "summary": "Full service multimedia/interactive web content production company. Hand made interactive content solutions for education, games, entertainment and business training.",
      "highlights": [
        "Consulted customers on business strategy of their content to encourage end user engagement",
        "Developed and marketed plug n' play javascript modules for mass consumers to sell online",
        "Heavily coded robust multimedia content in actionscript",
        "Provided unique content including but not limited to text, photographs, and graphic design for customers",
        "Retained customer loyalty through excellent service and ongoing maintenance agreements"
      ]
    }
  ],
  "skills": [
    {
      "name": "Automation Tools",
      "keywords": [
        "Ansible",
        "Boto",
        "Chef",
        "CircleCI",
        "Drone CI",
        "Gradle",
        "Jenkins",
        "Puppet",
        "Spinnaker",
        "Terraform",
        "Travis"
      ]
    },
    {
      "name": "Cloud providers",
      "keywords": ["AWS", "GKE", "Heroku", "Azure"]
    },
    {
      "name": "Code",
      "keywords": [
        "bash",
        "c",
        "elixir",
        "erlang",
        "go",
        "javascript",
        "lua",
        "node",
        "php",
        "python",
        "ruby"
      ]
    },
    {
      "name": "Datastores",
      "keywords": [
        "BigQuery",
        "CouchDB",
        "Kafka",
        "MongoDB",
        "Memcache(d)",
        "MySQL",
        "Postgres",
        "Redis",
        "RDS"
      ]
    },
    {
      "name": "LMA ( Logging, Monitoring, & Alerting )",
      "keywords": [
        "AWS",
        "ELK",
        "Grafana",
        "InfluxDB",
        "Loggly",
        "LogRythm",
        "Nagios",
        "Opsgenie",
        "PagerDuty",
        "Pingdom",
        "Prometheus",
        "Sensu",
        "ServiceNow",
        "Slack",
        "Splunk"
      ]
    },
    {
      "name": "Methodologies",
      "keywords": [
        "12Factor",
        "Agile",
        "Automation",
        "BDD",
        "CI/CD",
        "DAST",
        "DRY",
        "GitOps",
        "IaC",
        "Immutability",
        "KanBan",
        "Machine learning",
        "Networking",
        "OOP",
        "Polymorphism",
        "REST",
        "SAST",
        "SCRUM",
        "Scalability",
        "TDD",
        "K.I.S.S"
      ]
    },
    {
      "name": "Security",
      "keywords": [
        "Kali Linux",
        "Applied Cryptography",
        "Black Arch",
        "Intrusion detection",
        "Metasploit",
        "Nessus",
        "Nikto",
        "Security Onion"
      ]
    },
    {
      "name": "Systems & Servers",
      "keywords": ["*nix", "Apache", "Caddy", "Docker", "Nginx", "Kubernetes"]
    }
  ],
  "interests": [
    {
      "keywords": [
        "blockchain",
        "cryptography",
        "cybersecurity",
        "freeskating",
        "hacking",
        "hiking",
        "linux",
        "longboarding",
        "snowboarding",
        "travel",
        "yoga"
      ]
    }
  ]
}
