{
  "meta": { "theme": "elegant" },
  "basics": {
    "name": "Brandon M. Camenisch",
    "picture": "bio.jpg",
    "location": {
      "city": "Coeur d'Alene",
      "region": "ID",
      "countryCode": "USA"
    },
    "website": "https://brandoncamenisch.com",
    "summary": "With over 20 years of experience in development, leadership, and project management, I get the job done with top quality results every time. From being a key player in the DevOps team of Penske Media Corporation to ample experience with open-source technologies, I live and breathe development and infrastructure. Upper management and peers have found my can-do attitude and willingness to go above and beyond invaluable. I am seeking a position with greater responsibilities, cutting-edge tooling, and new development challenges. I have a proven track record of excellence, including:",
    "highlights": [
      "Recognition for Subject Matter Expertise</b> in DevOps tooling, cloud infrastructure, and software architecture.",
      "Demonstrating Outstanding Leadership in engineer mentoring, project management, and incidence response.",
      "Making Effective Executive Decisions regarding deployment strategy, team building, infrastructure budgets, and operational objectives."
    ],
    "profiles": [
      {
        "network": "Github",
        "username": "brandoncamenisch",
        "url": "https://github.com/brandoncamenisch"
      },
      {
        "network": "LinkedIn",
        "url": "https://www.linkedin.com/in/brandon-camenisch-625288212"
      },
      {
        "network": "URL",
        "url": "https://nindevdo.com"
      }
    ]
  },
  "work": [
    {
      "company": "PMC (Penske Media Corporation)",
      "position": "Senior DevOps engineer",
      "website": "https://pmc.com",
      "startDate": "2018-01-01",
      "summary": "PMC is a digital media company with an impressive portfolio of publishing sites with a heavy usage of microservices to support those sites and company infrastructure.",
      "highlights": [
        "Advocated for and implemented 12 factor app methodology, immutability, automation/abstraction of workflows into our microservices architecture",
        "Architected, iterated and managed company IaC across multiple cloud providers using Terraform in automation via GitOps",
        "Autonomously identified weaknesses in our workflows and improved upon them",
        "Dominated integrations using Terraform with external services ike cloudflare, fastly, Datadog, OpsGenie, GitHub, etc.",
        "Enabled team by advocating a self service approach in our CI/CD by incorporating modularity into our pipelines",
        "Established baseline CI/CD at the company defining end-to-end automated testing to the microservice application stacks",
        "Maintained self-hosted LMA & ELK stacks",
        "Management of microservice(s) automation and their internal networking via Terraform utilizing Rancher 1.0 on AWS",
        "Modularized existing monolithic, difficult to scale patterns into a lightweight re-usable architecture format",
        "Regularly met with customer/stakeholder(s) to maintain velocity of engineering team and strengthen overall DevOps culture"
      ]
    },
    {
      "company": "PMC ( Penske Media Corporation )",
      "position": "Senior Software Engineer",
      "website": "http://pmc.com",
      "startDate": "2017-01-01",
      "endDate": "2018-01-01",
      "summary": "PMC is a digital media company with an impressive portfolio of publishing sites and a heavy usage of microservices to support those sites and company infrastructure",
      "highlights": [
        "Audited and executed automation of security best practices into our codebase",
        "Conducted numerous large scale data & content migrations making heavy usage of realtime database replication via data streams",
        "Implemented caching layers to increase overall performance",
        "Created tooling for abstracting customer data solutions using a/b testing, ad tech & analytics",
        "Integrated scalable modular codebase solutions into our existing infrastructure",
        "Orchestrated foundation for modularized automated testing workflows using Docker"
      ]
    },
    {
      "company": "10up",
      "position": "Senior Engineering Manager",
      "website": "https://10up.com",
      "startDate": "2016-01-01",
      "endDate": "2017-01-01",
      "summary": "Managed agency engineering team for fortune 100 company projects. 10up is a high energy fast paced digital agency which caters solutions for big name brands.",
      "highlights": [
        "Accurately estimated out large complex projects for big name fortune 100 companies/clients",
        "Developed internal tooling for developer support using VirtualBox & docker",
        "Improved overall team efficiency and attitude(s) by empowering them with implementing tools, programming conventions, workflow improvements, and training",
        "Led engineering teams creating solutions for complex integrations and migrations",
        "Managed a successful team of engineers to deliver highly visible websites for fortune 100 companies",
        "Met with customers and vendors to ensure project(s) met technical and budget constraints",
        "Provided weekly 1:1 training and mentorship to a large team of engineers"
      ]
    },
    {
      "company": "10up",
      "position": "Senior software engineer",
      "website": "https://10up.com",
      "startDate": "2014-01-01",
      "endDate": "2016-01-01",
      "summary": "Finely crafting websites & tools for content creators.",
      "highlights": [
        "Contributed to WordPress core and other open source projects used throughout the WordPress community",
        "Developed custom content syncing software for managing content across many sites",
        "Horizontally scaled WordPress on AWS by offloading media and task execution on high traffic sites",
        "Regularly audited codebase(s) for security and best practices",
        "Triaged data sources from various services using REST api and GraphQL to supplement content creation driven by data"
      ]
    },
    {
      "company": "Volume Nine",
      "position": "Senior software engineer",
      "website": "https://www.v9digital.com/",
      "startDate": "2014-01-01",
      "endDate": "2015-01-01",
      "summary": "Volume Nine is Denver's top digital marketing agency, specializing in content, SEO, and social media. Build Brand. Drive Traffic. Grow Sales.",
      "highlights": [
        "Developed against large dataset(s) of marketing data with heavy usage of MySQL database and google analytics platform",
        "Strategized marketing/seo campaigns for client sites from a techinnal perspective",
        "Worked on early stage development/testing of SkyWord solution for WordPress"
      ]
    },
    {
      "company": "QRlicious",
      "position": "Senior software engineer",
      "startDate": "2013-01-01",
      "endDate": "2014-01-01",
      "summary": "QRlicious is a mobile marketing company offering a platform for users to manage and build QR codes, mobile websites, coupons, and more.",
      "highlights": [
        "Hand built a WordPress framework from the ground up using DRY & semantic approach",
        "Programmatically generated QR codes with custom built SVG tool(s) HTML5 canvas and RaphaëlJS",
        "Embraced mobile marketing microsites trend by building a SaaS product site building tool on Rails",
        "Engineered custom REST based APIs",
        "Integrated with various payment gateway systems for e-comm using Stripe, PayPal, Authorize.net and others"
      ]
    },
    {
      "company": "Concept Bakery",
      "position": "Senior software engineer & Graphic design",
      "startDate": "2012-01-01",
      "endDate": "2013-01-01",
      "summary": "Social media story development and telling: guerrilla & cross-media marketing. WOM on Facebook, YouTube, microsites, etc. You name it - been there done that :)",
      "highlights": [
        "Solely developed ruby on rails custom CMS application to create SaaS product based on microsites and Facebook pages",
        "e-commerce sales pipeline with integration of social media data of consumers",
        "Campaigned on social media to market customer products",
        "Frontend and graphic design heavy position creating marketing campaigns"
      ]
    },
    {
      "company": "Nerdatory",
      "position": "Consultant",
      "startDate": "2006-01-01",
      "endDate": "2012-01-01",
      "summary": "Consulting firm specializing in architecture, security and best practices of software development.",
      "highlights": [
        "Provided strategic engineering consulting to startups",
        "Demonstrated how to predict growth and scale a product without hitting a wall in the process",
        "Conducted in-depth security audits for clients identifying weaknesses in their corporate IT structure",
        "Collaborated with team of engineers to architect and reconstruct their SaaS product from the ground up",
        "Mentored teams in software life cycle processes using TDD, CI, code reviews, security conventions, and engineering best practices"
      ]
    },
    {
      "company": "Silvereve Interactive",
      "position": "Founder",
      "startDate": "2002-01-01",
      "endDate": "2000-01-01",
      "summary": "Full service multimedia/interactive web content production company. Hand made interactive content solutions for education, games, entertainment and business training.",
      "highlights": [
        "Consulted customers on business strategy of their content to encourage end user engagement",
        "Developed and marketed plug n' play javascript modules for mass consumers to sell online",
        "Heavily coded robust multimedia content in actionscript",
        "Provided unique content including but not limited to text, photographs, and graphic design for customers",
        "Retained customer loyalty through excellent service and ongoing maintenance agreements"
      ]
    },
    {
      "company": "Martial Arts Camp",
      "position": "Founder/Trainer",
      "startDate": "2006-01-01",
      "endDate": "2008-01-01",
      "summary": "Intensive live in martial arts training camp in the Colorado Rockies.",
      "highlights": [
        "Concepted curriculum for intensive full immersion martial arts & security training camp",
        "Developed website and unique branding content ( text, photo, video, seo, marketing, etc. ) for entire organization",
        "Exhaustively studied technical material and improved upon existing systems to produce the highest quality training we could",
        "Led and mentored groups to maximize their potential both as individuals and as a teams",
        "Trained students in curriculum physically and mentally",
        "Taught skills such as tactical knife fighting, lock picking, escape & evasion, stealth and more"
      ]
    },
    {
      "company": "U.S. Navy",
      "position": "Quartermaster",
      "startDate": "2002-01-01",
      "endDate": "2006-01-01",
      "summary": "The United States Navy is the naval warfare service branch of the United States Armed Forces and one of the eight uniformed services of the United States.",
      "highlights": [
        "Awarded commendation by captain of U.S.S Nimitz for excellent performance and honorable service to division",
        "Entrusted with top secret security intelligence information critical to operational success while underway in hostile zones",
        "Personally corrected over 5k navigational charts covering the globe and used for navigation in westpac operations",
        "Piloted aircraft carrier U.S.S Nimitz through operation Iraqi Freedom during two Westpac deployments",
        "Spent over 1000 hours providing navigational expertise by both traditional ( celestial ) and modern methods to bridge officers and crew"
      ]
    },
    {
      "company": "Stuff-It Storage",
      "position": "Self Storage Assistant",
      "startDate": "1995-01-01",
      "endDate": "2002-01-01",
      "summary": "Storage unit facility",
      "highlights": [
        "Drove large truck/trailer loads of 'stuff' to auctions",
        "Inventoried and managed large lists of items to be sold at auctions",
        "Investigated cost research/analysis of items",
        "Maintained customer relations involving billing, theft, or property damage",
        "Patrolled two locations of business premises for suspicious activity and break-ins"
      ]
    },
    {
      "company": "Best seamless rain gutters",
      "position": "Gutter Installer",
      "startDate": "1999-01-01",
      "endDate": "2002-01-01",
      "summary": "Seamless rain gutters company that served the front range of Colorado",
      "highlights": [
        "Estimated jobs from small houses to large residential or industrial properties and assessing risk",
        "Placed inventory cost replenishment orders for materials and crew",
        "Repaired leaking or damaged product",
        "Serviced seamless gutter tools & equipment critical to operation such as downspout machines, trucks, saws, and other tools",
        "Year round service to contracting and private builders"
      ]
    },
    {
      "company": "Brandons Pantry",
      "position": "Clerk/Manager",
      "startDate": "2000-01-01",
      "endDate": "2001-01-01",
      "summary": "Convenience store in recreational area of the Colorado Rocky Mountains",
      "highlights": [
        "Attended trade shows to promote business and develop relationships with vendors",
        "Identified and explored potential areas of profit by monitoring daily operations",
        "Inventoried product and kept track of finances",
        "Provided customer information in regards to travel and tourism in the area",
        "Self branded and started convenience store in recreational area"
      ]
    },
    {
      "company": "Indian Meadows",
      "position": "Assistant Manager",
      "startDate": "2000-01-01",
      "endDate": "2002-01-01",
      "summary": "Rustic recreational resort in the Poudre Canyon of the Colorado Rocky Mountains",
      "highlights": [
        "Cleaned and maintained a cluster of recreational cabins for camping tourists",
        "Developed customized hotel booking software to manage reservations, events, billing and other daily business",
        "Kept inventory and vendor relationships with wholesalers",
        "Maintained property grounds i.e. landscaping, repairs, and other maintenance type work",
        "Planned and catered events such as weddings, family reunions, business summits and other group events"
      ]
    },
    {
      "company": "Motor Vessel ENDEAVOUR",
      "position": "Navigation, Engineering, Deckhand",
      "startDate": "1997-01-01",
      "endDate": "2000-01-01",
      "summary": "U.S.S. Endeavour was a 70ft. 69 ton Ocean adventure trawling vessel.",
      "highlights": [
        "Chipped, grinded, painted & other laborious tasks to keep the vessel in working order",
        "Commandeered the 69ton Naval engineered trawling motor vessel through the open seas of the Western hemisphere and the international waterways of the southern United States",
        "Diligently held the comm while underway to ensure safe passage on voyages",
        "Maintained & calibrated sea faring equipment critical to the safe navigation of the vessel",
        "Repaired and maintained engines, generators, desalination systems, auxillary solar power systems, & other marine equipment"
      ]
    }
  ],
  "skills": [
    {
      "name": "♾️  Automation Tools",
      "keywords": [
        "Ansible",
        "Boto",
        "Chef",
        "CircleCI",
        "Drone CI",
        "Gradle",
        "Jenkins",
        "Puppet",
        "Spinnaker",
        "Terraform",
        "Travis"
      ]
    },
    {
      "name": "☁️  Cloud providers",
      "keywords": ["AWS", "GKE", "Heroku", "Azure"]
    },
    {
      "name": "💾 Code",
      "keywords": [
        "bash",
        "c",
        "elixir",
        "erlang",
        "go",
        "javascript",
        "lua",
        "node",
        "php",
        "python",
        "ruby"
      ]
    },
    {
      "name": "🗄️  Datastores",
      "keywords": [
        "BigQuery",
        "CouchDB",
        "Kafka",
        "MongoDB",
        "Memcache(d)",
        "MySQL",
        "Postgres",
        "Redis",
        "RDS"
      ]
    },
    {
      "name": "🗠 LMA ( Logging, Monitoring, & Alerting )",
      "keywords": [
        "AWS",
        "ELK",
        "Grafana",
        "InfluxDB",
        "Loggly",
        "LogRythm",
        "Nagios",
        "Opsgenie",
        "PagerDuty",
        "Pingdom",
        "Prometheus",
        "Sensu",
        "ServiceNow",
        "Slack",
        "Splunk"
      ]
    },
    {
      "name": "🤔 Methodologies",
      "keywords": [
        "12Factor",
        "Agile",
        "Automation",
        "BDD",
        "CI/CD",
        "DAST",
        "DRY",
        "GitOps",
        "IaC",
        "Immutability",
        "KanBan",
        "Machine learning",
        "Networking",
        "OOP",
        "Polymorphism",
        "REST",
        "SAST",
        "SCRUM",
        "Scalability",
        "TDD",
        "K.I.S.S"
      ]
    },
    {
      "name": "🛡️  Security",
      "keywords": [
        "Kali Linux",
        "Applied Cryptography",
        "Black Arch",
        "Intrusion detection",
        "Metasploit",
        "Nessus",
        "Nikto",
        "Security Onion"
      ]
    },
    {
      "name": "🖥️  Systems & Servers",
      "keywords": ["*nix", "Apache", "Caddy", "Docker", "Nginx", "Kubernetes"]
    }
  ],
  "interests": [
    {
      "keywords": [
        "blockchain",
        "cryptography",
        "cybersecurity",
        "freeskating",
        "hacking",
        "hiking",
        "linux",
        "longboarding",
        "snowboarding",
        "travel",
        "yoga"
      ]
    }
  ]
}
